| A | B | C |
|---+---+---|
| 1 | 2 | 3 |
| 4 | 5 | 6 |
#+TBLFM: $3=$1+$2
#+TBLFM: $2=$1*2

# Formula edge cases

* Absolute/relative references
| X | Y | Z |
|---+---+---|
| 2 | 3 |   |
| 5 | 7 |   |
#+TBLFM: $3=$1+$2;%.1f::$2=@-1$2+1

* Named references and constants
#+CONSTANTS: pi=3.1416
| Angle | Sin | Pi |
|-------+-----+----|
| 30    |     |    |
| 90    |     |    |
#+TBLFM: $2=sin($1*pi/180);%.3f::$3=$pi

* Remote references
#+NAME: table1
| A | B |
|---+---|
| 1 | 2 |
| 3 | 4 |

| RefA | RefB |
|------+------|
|      |      |
#+TBLFM: $1='(identity remote(table1,@1$1))'::$2='(identity remote(table1,@2$2))'

* Range references and vector functions
| V1 | V2 | Mean |
|----+----+------|
| 10 | 20 |      |
| 30 | 40 |      |
#+TBLFM: $3=vmean($1..$2);%.2f

* Field formula, column formula, range formula
| A | B | C |
|---+---+---|
| 1 | 2 |   |
| 3 | 4 |   |
#+TBLFM: $3=$1+$2::$2=2*$1

* Anchor references (hline, first/last row/col)
| A | B | C |
|---+---+---|
| 1 | 2 | 3 |
|---+---+---|
| 4 | 5 | 6 |
#+TBLFM: $3=@<..@>;%.1f

* Empty fields and error handling
| A | B | C |
|---+---+---|
|   | 2 |   |
| 3 |   |   |
#+TBLFM: $3=if("$1"=="nan"||"$2"=="nan",string("error"),$1+$2)

* Emacs Lisp formula
| S | T |
|---+---|
| ab |   |
| cd |   |
#+TBLFM: $2='(concat $1 "-suffix")

* Multiple TBLFM lines, formula override
| X | Y |
|---+---|
| 1 |   |
| 2 |   |
#+TBLFM: $2=$1*2
#+TBLFM: $2=$1*3

* Formula debugging (simulate error)
| A | B |
|---+---|
| 1 | 0 |
| 2 | 0 |
#+TBLFM: $2=$1/0
